---
title: DeleteElements
classe: Autodesk.Revit.DB.DeleteElements
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.FailureResolution
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# DeleteElements

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureResolution Create(Document, ElementId)` | `DeleteElements.Create(document, id)` | FailureResolution |
| `FailureResolution Create(Document, IList<ElementId>)` | `DeleteElements.Create(document, ids)` | FailureResolution |
| `FailureResolution Create(Document, ISet<ElementId>)` | `DeleteElements.Create(document, ids)` | FailureResolution |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```